MHD/shercliff_mhdFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          800;
        startFace       233200;
    }
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       234000;
    }
    lowerWall
    {
        type            patch;
        nFaces          2000;
        startFace       234800;
    }
    upperWall
    {
        type            patch;
        nFaces          2000;
        startFace       236800;
    }
    frontWall
    {
        type            patch;
        nFaces          4000;
        startFace       238800;
    }
    backWall
    {
        type            patch;
        nFaces          4000;
        startFace       242800;
    }
)

// ************************************************************************* //
